tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/bundle"

# brew install
brew "bat"
brew "cocoapods"
brew "fasd" # cli directory jump
brew "fzf" # fuzzy finder
brew "git"
brew "git-lfs" # git large file storage
brew "mas" # Mac App Store
brew "neovim"
brew "nvm" # node version manager


# cask install
cask "alfred"
cask "android-studio"
cask "appcleaner"
cask "camo-studio"
cask "dash"
cask "deepl" # translator
cask "discord"
cask "figma"
cask "gitkraken"
cask "google-chrome"
cask "hammerspoon"
cask "keka"
cask "maccy" # clipboard manager
cask "menubarx"
cask "monitorcontrol" # monitor brightness
cask "movist-pro"
cask "notion"
cask "paw" # api client
cask "postman" # api client
cask "proxyman" # proxy client
cask "slack"
cask "tableplus"
cask "visual-studio-code"
cask "warp"
cask "zoom"


# Mac App
mas "Accelerate for Safari", id: 1459809092
mas "Amphetamine", id: 937984704
mas "Apple Developer", id: 640199958
mas "BetterJSON for Safari", id: 1511935951
mas "Cleaner for Xcode", id: 1296084683
mas "ColorSlurp", id: 1287239339
mas "DaisyDisk", id: 411643860
mas "Dark Reader for Safari", id: 1438243180
mas "Enpass - Password Manager", id: 732710998
mas "Gifski", id: 1351639930
mas "KakaoTalk", id: 869223134
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Octotree", id: 1457450145
mas "SnippetsLab", id: 1006087419
mas "SortingMatters", id: 1556795117
mas "Sourcegraph for Safari", id: 1543262193
mas "Spark – Email App by Readdle", id: 1176895641
mas "Unicorn Blocker", id: 1231935892
mas "Yoink", id: 457622435
