tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/bundle"

# brew install
brew "bat"
brew "fasd"
brew "fzf"
brew "git"
brew "git-lfs"
brew "mas"
brew "neofetch"
brew "neovim"
brew "tig"
brew "zsh"


# cask install
cask "alfred"
cask "appcleaner"
cask "camo-studio"
cask "dash"
cask "figma"
cask "gitkraken"
cask "google-chrome"
cask "hammerspoon"
cask "iterm2"
cask "keka"
cask "monitorcontrol"
cask "notion"
cask "paw"
cask "sensei"
cask "slack"
cask "telegram"
cask "visual-studio-code"
cask "zoom"


# Mac App
mas "Accelerate for Safari", id: 1459809092
mas "Amphetamine", id: 937984704
mas "BetterJSON for Safari", id: 1511935951
mas "ColorSlurp", id: 1287239339
mas "DaisyDisk", id: 411643860
mas "Dark Reader for Safari", id: 1438243180
mas "Enpass - Password Manager", id: 732710998
mas "Gifski", id: 1351639930
mas "KakaoTalk", id: 869223134
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Movist", id: 461788075
mas "Octotree", id: 1457450145
mas "SnippetsLab", id: 1006087419
mas "Spark – Email App by Readdle", id: 1176895641
mas "Unicorn Blocker", id: 1231935892
mas "Yoink", id: 457622435








